---
kind: other
id: Methods.T:Autodesk.Revit.DB.Events.ViewPrintingEventArgs
source: html/403b4f07-563a-4fb0-5197-419a0042d5fd.htm
---
# ViewPrintingEventArgs Methods

When the event is cancellable, may call the Cancel() method to cancel it.